app/controllers/home_controller.rb

  def index
    @recipes = Recipe.includes(:ingredients).take(5)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (1, 2, 3, 4, 5, 6, 8, 7, 9, 10, 11, 12, 13, 14, 26, 25, 27, 28, 29, 30, 31, 32, 33, 34, 39, 19, 35, 36)
SELECT "recipes".* FROM "recipes" LIMIT 5