app/controllers/recipes_controller.rb

    def set_recipe
      @recipe = Recipe.find(params.expect(:id))
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = 1 LIMIT 1