app/controllers/search_controller.rb

  def index
    ingredient_query = params[:ingredient_query]
      if ingredient_query.present?
        @recipematch = Recipe.joins(:recipe_ingredients, :ingredients).where("ingredients.ingr_name LIKE ?", "%#{ingredient_query}%").distinct
---
SELECT DISTINCT "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipe_ingredients"."recipe_id" = "recipes"."id" INNER JOIN "recipe_ingredients" "recipe_ingredients_recipes_join" ON "recipe_ingredients_recipes_join"."recipe_id" = "recipes"."id" INNER JOIN "ingredients" ON "ingredients"."id" = "recipe_ingredients_recipes_join"."ingredient_id" WHERE (ingredients.ingr_name LIKE '%beef%')