app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest", "is_admin", "status", "created_at", "updated_at") VALUES ('Marcus', 'Ruhl', 'mruhl@email.com', '$2a$12$00kNCV5oZdSXseug3PDJdO55Tvnv/vnBIz4jEIkWyQdKSFe5SIT2y', 0, 'Active', '2025-09-28 03:52:15.495261', '2025-09-28 03:52:15.495261') RETURNING "id"